# SQL QUERIES

In [2]:
# import package
from sqlalchemy import create_engine
import pandas as pd

In [31]:
engine = create_engine('sqlite:///census.sqlite')
con = engine.connect()

**Load Data**

**select * from table_name**

In [32]:
query = con.execute("select * FROM census")
# show column from census table
print(query.keys())

['state', 'sex', 'age', 'pop2000', 'pop2008']

In [33]:
# census table
census = query.fetchall()
census[:5]

[('Illinois', 'M', 0, 89600, 95012),
 ('Illinois', 'M', 1, 88445, 91829),
 ('Illinois', 'M', 2, 88729, 89547),
 ('Illinois', 'M', 3, 88868, 90037),
 ('Illinois', 'M', 4, 91947, 91111)]

In [34]:
query = con.execute('select state,age from census').fetchall()
query[:5]

[('Illinois', 0),
 ('Illinois', 1),
 ('Illinois', 2),
 ('Illinois', 3),
 ('Illinois', 4)]

**search unique records or return only different values. Inside a table, a column often contains many duplicate values**

**select distinct columns from table name**

In [36]:
# show contents of columns state 
query = con.execute("select distinct State from census").fetchall()
query

[('Illinois',),
 ('New Jersey',),
 ('District of Columbia',),
 ('North Dakota',),
 ('Florida',),
 ('Maryland',),
 ('Idaho',),
 ('Massachusetts',),
 ('Oregon',),
 ('Nevada',),
 ('Michigan',),
 ('Wisconsin',),
 ('Missouri',),
 ('Washington',),
 ('North Carolina',),
 ('Arizona',),
 ('Arkansas',),
 ('Colorado',),
 ('Indiana',),
 ('Pennsylvania',),
 ('Hawaii',),
 ('Kansas',),
 ('Louisiana',),
 ('Alabama',),
 ('Minnesota',),
 ('South Dakota',),
 ('New York',),
 ('California',),
 ('Connecticut',),
 ('Ohio',),
 ('Rhode Island',),
 ('Georgia',),
 ('South Carolina',),
 ('Alaska',),
 ('Delaware',),
 ('Tennessee',),
 ('Vermont',),
 ('Montana',),
 ('Kentucky',),
 ('Utah',),
 ('Nebraska',),
 ('West Virginia',),
 ('Iowa',),
 ('Wyoming',),
 ('Maine',),
 ('New Hampshire',),
 ('Mississippi',),
 ('Oklahoma',),
 ('New Mexico',),
 ('Virginia',),
 ('Texas',)]

In [41]:
query = con.execute('select distinct sex from census').fetchall()
query

[('M',), ('F',)]

In [60]:
# find count unique contents of state columns
query = con.execute('select count(distinct state) from census').fetchall()
query

[(51,)]

**Filter**

**select column from table where condition**

In [62]:
# show state columns = New York 
query = con.execute("select * from census WHERE state='New York'").fetchall()
query[:5]

[('New York', 'M', 0, 126237, 128088),
 ('New York', 'M', 1, 124008, 125649),
 ('New York', 'M', 2, 124725, 121615),
 ('New York', 'M', 3, 126697, 120580),
 ('New York', 'M', 4, 131357, 122482)]

In [66]:
for row in query[:5]:
    print(row.state, row.age, row.pop2000, row.pop2008)

New York 0 126237 128088
New York 1 124008 125649
New York 2 124725 121615
New York 3 126697 120580
New York 4 131357 122482

In [73]:
# filter any data use IN
ag = (4,5,8,9,20)
query = con.execute('select * from census where age in (ag)').fetchmany(10)
query

[('Illinois', 'M', 0, 89600, 95012),
 ('Illinois', 'M', 1, 88445, 91829),
 ('Illinois', 'M', 2, 88729, 89547),
 ('Illinois', 'M', 3, 88868, 90037),
 ('Illinois', 'M', 4, 91947, 91111),
 ('Illinois', 'M', 5, 93894, 89802),
 ('Illinois', 'M', 6, 93676, 88931),
 ('Illinois', 'M', 7, 94818, 90940),
 ('Illinois', 'M', 8, 95035, 86943),
 ('Illinois', 'M', 9, 96436, 86055)]

In [83]:
# filter any data use LIKE
query = con.execute("select distinct * from census WHERE state LIKE 'T%'").fetchmany(10)
query

[('Tennessee', 'M', 0, 38916, 43537),
 ('Tennessee', 'M', 1, 38569, 43343),
 ('Tennessee', 'M', 2, 38157, 42592),
 ('Tennessee', 'M', 3, 37780, 41530),
 ('Tennessee', 'M', 4, 38789, 41627),
 ('Tennessee', 'M', 5, 39442, 40758),
 ('Tennessee', 'M', 6, 39262, 40963),
 ('Tennessee', 'M', 7, 40356, 42287),
 ('Tennessee', 'M', 8, 41016, 41043),
 ('Tennessee', 'M', 9, 42320, 40944)]

In [91]:
# filter any data which is generate age contains 1 until 3 and state cointain the first letter T
query = con.execute("select * from census WHERE age BETWEEN 1 AND 3 AND state LIKE 'T%'").fetchmany(10)
query

[('Tennessee', 'M', 1, 38569, 43343),
 ('Tennessee', 'M', 2, 38157, 42592),
 ('Tennessee', 'M', 3, 37780, 41530),
 ('Tennessee', 'F', 1, 36418, 41207),
 ('Tennessee', 'F', 2, 36341, 41096),
 ('Tennessee', 'F', 3, 36124, 39945),
 ('Texas', 'M', 1, 165635, 208828),
 ('Texas', 'M', 2, 165337, 206795),
 ('Texas', 'M', 3, 164292, 205343),
 ('Texas', 'F', 1, 158669, 199810)]

**Order BY**

**select columns from table ORDER BY column1, column2, ... ASC|DESC**

In [92]:
# order by pop2000 columns
query = con.execute("select * from census ORDER BY pop2000").fetchall()
query[:10]

[('Alaska', 'M', 84, 217, 391),
 ('Alaska', 'M', 83, 236, 424),
 ('Alaska', 'M', 82, 310, 469),
 ('Alaska', 'M', 81, 350, 568),
 ('Alaska', 'F', 84, 362, 519),
 ('Alaska', 'F', 83, 394, 624),
 ('Alaska', 'M', 80, 441, 648),
 ('Alaska', 'F', 81, 443, 701),
 ('Alaska', 'F', 82, 451, 648),
 ('Alaska', 'M', 79, 470, 681)]

In [100]:
# order by state from higher value to small value and pop2000 from small value to higher value
query = con.execute("select * from census ORDER BY state DESC, pop2000 ASC").fetchall()
query[:5]

[('Wyoming', 'M', 84, 490, 643),
 ('Wyoming', 'M', 83, 515, 726),
 ('Wyoming', 'M', 82, 634, 792),
 ('Wyoming', 'M', 81, 687, 845),
 ('Wyoming', 'F', 84, 801, 878)]

**How to Test for NULL Values?**

**select column from table where column IS NULL**

In [114]:
query = con.execute("select * from census where state IS NULL").fetchall()
query

[]

**GROUP BY**

**select column from table GROUP BY column**

In [117]:
query = con.execute('select state, count(age) from census GROUP BY state').fetchall()
query[:5]

[('Alabama', 172),
 ('Alaska', 172),
 ('Arizona', 172),
 ('Arkansas', 172),
 ('California', 172)]

In [142]:
# find average population for each state
query = con.execute('select state, AVG(pop2000) AS average_2000 ,AVG(pop2008) AS average_2008 from census GROUP BY state').fetchall()
for row in query[:5]:
    print('State : ' + row.state+ ' have average in 2000 : ' + str(row.average_2000))

print(" ")

for row in query[:5]:
    print("State : " +row.state+ " have average in 2008 : " +str(row.average_2008))

State : Alabama have average in 2000 : 25805.575581395347
State : Alaska have average in 2000 : 3538.3023255813955
State : Arizona have average in 2000 : 29906.575581395347
State : Arkansas have average in 2000 : 15537.406976744185
State : California have average in 2000 : 196682.8023255814

State : Alabama have average in 2008 : 27031.20348837209
State : Alaska have average in 2008 : 3863.639534883721
State : Arizona have average in 2008 : 37678.87790697674
State : Arkansas have average in 2008 : 16560.6511627907
State : California have average in 2008 : 212843.03488372092

In [140]:
query[0].keys()

['state', 'average_2000', 'average_2008']

In [185]:
# calculate precentage of men in population 2000
# for convert integer to float you can use 'CAST ... AS FLOAT'
query = con.execute("select ROUND(CAST(SUM(CASE WHEN sex ='M' THEN pop2000 ELSE 0 END) AS FLOAT)*100/SUM(pop2000),2) FROM census").scalar()
print('precentage of population in 2000: {} %' .format(query))

precentage of population in 2000: 48.91 %
48

In [153]:
# calculate precentage of men in population 2000 
query = con.execute("select SUM(pop2008)-SUM(pop2000) from census").scalar()
print('The difference of population in 2008 and 2000: {}' .format(query))

The difference of population in 2008 and 2000: 21957308

**JOIN**

 to combine rows from two or more tables, based on a related column between them.

In [213]:
query = con.execute("select * from census INNER JOIN state_fact on census.state = state_fact.name GROUP BY census.state")
df = pd.DataFrame(query.fetchall())
df.columns = query.keys()
df.head()

,state,sex,age,pop2000,pop2008,id,name,abbreviation,country,type,...,occupied,notes,fips_state,assoc_press,standard_federal_region,census_region,census_region_name,census_division,census_division_name,circuit_court
0,Alabama,M,0,30479,32055,1,Alabama,AL,USA,state,...,occupied,,1,Ala.,IV,3,South,6,East South Central,11
1,Alaska,M,0,4934,5674,2,Alaska,AK,USA,state,...,occupied,,2,Alaska,X,4,West,9,Pacific,9
2,Arizona,M,0,40415,54792,3,Arizona,AZ,USA,state,...,occupied,,4,Ariz.,IX,4,West,8,Mountain,9
3,Arkansas,M,0,18616,21165,4,Arkansas,AR,USA,state,...,occupied,,5,Ark.,VI,3,South,7,West South Central,8
4,California,M,0,252494,287900,5,California,CA,USA,state,...,occupied,,6,Calif.,IX,4,West,9,Pacific,9

In [214]:
df.shape

(50, 22)